app/controllers/api/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    @tracks = Track.all